#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_disk.game_data_disk: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/disks/game-data-disk]
google_compute_network.vpc_network: Refreshing state... [id=projects/minecraft-abekoh/global/networks/minecraft-network]
google_compute_address.static_ip: Refreshing state... [id=projects/minecraft-abekoh/regions/asia-northeast1/addresses/minecraft-server-static-ip]
google_compute_firewall.allow_icmp: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-icmp]
google_compute_firewall.allow_minecraft: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-minecraft]
google_compute_firewall.allow_ssh: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-ssh]
google_compute_instance.vm_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.bot_instance will be created
  + resource "google_compute_instance" "bot_instance" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata             = {
          + "enable-oslogin"     = "TRUE"
          + "startup-script-url" = "gs://minecraft-abekoh-scripts/setup-discord-bot-server.sh"
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "minecraft-abekoh-discord-bot"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20210720"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "minecraft-network"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = "minecraft-server@minecraft-abekoh.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @abekoh, Action: `pull_request`, Working Directory: ``, Workflow: `validate & plan Terraform`*